avrdudes/avr-libc/include/avr/ioavr16dd28.h
/* Channel 5 generator select bit group values */
typedef enum EVSYS_CHANNEL5_VALUES_enum
{
    EVSYS_CHANNEL5_OFF_gv          = 0x00,  /* Off */
    EVSYS_CHANNEL5_UPDI_SYNCH_gv   = 0x01,  /* UPDI SYNCH character */
    EVSYS_CHANNEL5_MVIO_gv         = 0x05,  /* MVIO VDDIO2 OK */
    EVSYS_CHANNEL5_RTC_OVF_gv      = 0x06,  /* Real Time Counter overflow */
    EVSYS_CHANNEL5_RTC_CMP_gv      = 0x07,  /* Real Time Counter compare */
    EVSYS_CHANNEL5_RTC_PIT_DIV512_gv = 0x08,  /* Periodic Interrupt Timer output 0 */
    EVSYS_CHANNEL5_RTC_PIT_DIV256_gv = 0x09,  /* Periodic Interrupt Timer output 1 */
    EVSYS_CHANNEL5_RTC_PIT_DIV128_gv = 0x0A,  /* Periodic Interrupt Timer output 2 */
    EVSYS_CHANNEL5_RTC_PIT_DIV64_gv = 0x0B,  /* Periodic Interrupt Timer output 3 */
    EVSYS_CHANNEL5_CCL_LUT0_gv     = 0x10,  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL5_CCL_LUT1_gv     = 0x11,  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL5_CCL_LUT2_gv     = 0x12,  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL5_CCL_LUT3_gv     = 0x13,  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL5_AC0_OUT_gv      = 0x20,  /* Analog Comparator 0 out */
    EVSYS_CHANNEL5_ADC0_RESRDY_gv  = 0x24,  /* ADC 0 Result Ready */
    EVSYS_CHANNEL5_ZCD3_gv         = 0x30,  /* Zero Cross Detect 3 out */
    EVSYS_CHANNEL5_PORTF_PIN0_gv   = 0x48,  /* Port F Pin 0 */
    EVSYS_CHANNEL5_PORTF_PIN1_gv   = 0x49,  /* Port F Pin 1 */
    EVSYS_CHANNEL5_PORTF_PIN6_gv   = 0x4E,  /* Port F Pin 6 */
    EVSYS_CHANNEL5_PORTF_PIN7_gv   = 0x4F,  /* Port F Pin 7 */
    EVSYS_CHANNEL5_USART0_XCK_gv   = 0x60,  /* USART 0 XCK */
    EVSYS_CHANNEL5_USART1_XCK_gv   = 0x61,  /* USART 1 XCK */
    EVSYS_CHANNEL5_SPI0_SCK_gv     = 0x68,  /* SPI 0 SCK */
    EVSYS_CHANNEL5_TCA0_OVF_LUNF_gv = 0x80,  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL5_TCA0_HUNF_gv    = 0x81,  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL5_TCA0_CMP0_LCMP0_gv = 0x84,  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL5_TCA0_CMP1_LCMP1_gv = 0x85,  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL5_TCA0_CMP2_LCMP2_gv = 0x86,  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL5_TCB0_CAPT_gv    = 0xA0,  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL5_TCB0_OVF_gv     = 0xA1,  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL5_TCB1_CAPT_gv    = 0xA2,  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL5_TCB1_OVF_gv     = 0xA3,  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL5_TCB2_CAPT_gv    = 0xA4,  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL5_TCB2_OVF_gv     = 0xA5,  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL5_TCD0_CMPBCLR_gv = 0xB0,  /* Timer/Counter D0 event 0 */
    EVSYS_CHANNEL5_TCD0_CMPASET_gv = 0xB1,  /* Timer/Counter D0 event 1 */
    EVSYS_CHANNEL5_TCD0_CMPBSET_gv = 0xB2,  /* Timer/Counter D0 event 2 */
    EVSYS_CHANNEL5_TCD0_PROGEV_gv  = 0xB3   /* Timer/Counter D0 event 3 */
} EVSYS_CHANNEL5_values_t;

/* Channel 5 generator select bit group configurations*/
typedef enum EVSYS_CHANNEL5_enum
{
    EVSYS_CHANNEL5_OFF_gc          = (EVSYS_CHANNEL5_OFF_gv << EVSYS_CHANNEL5_gp),  /* Off */
    EVSYS_CHANNEL5_UPDI_SYNCH_gc   = (EVSYS_CHANNEL5_UPDI_SYNCH_gv << EVSYS_CHANNEL5_gp),  /* UPDI SYNCH character */
    EVSYS_CHANNEL5_MVIO_gc         = (EVSYS_CHANNEL5_MVIO_gv << EVSYS_CHANNEL5_gp),  /* MVIO VDDIO2 OK */
    EVSYS_CHANNEL5_RTC_OVF_gc      = (EVSYS_CHANNEL5_RTC_OVF_gv << EVSYS_CHANNEL5_gp),  /* Real Time Counter overflow */
    EVSYS_CHANNEL5_RTC_CMP_gc      = (EVSYS_CHANNEL5_RTC_CMP_gv << EVSYS_CHANNEL5_gp),  /* Real Time Counter compare */
    EVSYS_CHANNEL5_RTC_PIT_DIV512_gc = (EVSYS_CHANNEL5_RTC_PIT_DIV512_gv << EVSYS_CHANNEL5_gp),  /* Periodic Interrupt Timer output 0 */
    EVSYS_CHANNEL5_RTC_PIT_DIV256_gc = (EVSYS_CHANNEL5_RTC_PIT_DIV256_gv << EVSYS_CHANNEL5_gp),  /* Periodic Interrupt Timer output 1 */
    EVSYS_CHANNEL5_RTC_PIT_DIV128_gc = (EVSYS_CHANNEL5_RTC_PIT_DIV128_gv << EVSYS_CHANNEL5_gp),  /* Periodic Interrupt Timer output 2 */
    EVSYS_CHANNEL5_RTC_PIT_DIV64_gc = (EVSYS_CHANNEL5_RTC_PIT_DIV64_gv << EVSYS_CHANNEL5_gp),  /* Periodic Interrupt Timer output 3 */
    EVSYS_CHANNEL5_CCL_LUT0_gc     = (EVSYS_CHANNEL5_CCL_LUT0_gv << EVSYS_CHANNEL5_gp),  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL5_CCL_LUT1_gc     = (EVSYS_CHANNEL5_CCL_LUT1_gv << EVSYS_CHANNEL5_gp),  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL5_CCL_LUT2_gc     = (EVSYS_CHANNEL5_CCL_LUT2_gv << EVSYS_CHANNEL5_gp),  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL5_CCL_LUT3_gc     = (EVSYS_CHANNEL5_CCL_LUT3_gv << EVSYS_CHANNEL5_gp),  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL5_AC0_OUT_gc      = (EVSYS_CHANNEL5_AC0_OUT_gv << EVSYS_CHANNEL5_gp),  /* Analog Comparator 0 out */
    EVSYS_CHANNEL5_ADC0_RESRDY_gc  = (EVSYS_CHANNEL5_ADC0_RESRDY_gv << EVSYS_CHANNEL5_gp),  /* ADC 0 Result Ready */
    EVSYS_CHANNEL5_ZCD3_gc         = (EVSYS_CHANNEL5_ZCD3_gv << EVSYS_CHANNEL5_gp),  /* Zero Cross Detect 3 out */
    EVSYS_CHANNEL5_PORTF_PIN0_gc   = (EVSYS_CHANNEL5_PORTF_PIN0_gv << EVSYS_CHANNEL5_gp),  /* Port F Pin 0 */
    EVSYS_CHANNEL5_PORTF_PIN1_gc   = (EVSYS_CHANNEL5_PORTF_PIN1_gv << EVSYS_CHANNEL5_gp),  /* Port F Pin 1 */
    EVSYS_CHANNEL5_PORTF_PIN6_gc   = (EVSYS_CHANNEL5_PORTF_PIN6_gv << EVSYS_CHANNEL5_gp),  /* Port F Pin 6 */
    EVSYS_CHANNEL5_PORTF_PIN7_gc   = (EVSYS_CHANNEL5_PORTF_PIN7_gv << EVSYS_CHANNEL5_gp),  /* Port F Pin 7 */
    EVSYS_CHANNEL5_USART0_XCK_gc   = (EVSYS_CHANNEL5_USART0_XCK_gv << EVSYS_CHANNEL5_gp),  /* USART 0 XCK */
    EVSYS_CHANNEL5_USART1_XCK_gc   = (EVSYS_CHANNEL5_USART1_XCK_gv << EVSYS_CHANNEL5_gp),  /* USART 1 XCK */
    EVSYS_CHANNEL5_SPI0_SCK_gc     = (EVSYS_CHANNEL5_SPI0_SCK_gv << EVSYS_CHANNEL5_gp),  /* SPI 0 SCK */
    EVSYS_CHANNEL5_TCA0_OVF_LUNF_gc = (EVSYS_CHANNEL5_TCA0_OVF_LUNF_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL5_TCA0_HUNF_gc    = (EVSYS_CHANNEL5_TCA0_HUNF_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL5_TCA0_CMP0_LCMP0_gc = (EVSYS_CHANNEL5_TCA0_CMP0_LCMP0_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL5_TCA0_CMP1_LCMP1_gc = (EVSYS_CHANNEL5_TCA0_CMP1_LCMP1_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL5_TCA0_CMP2_LCMP2_gc = (EVSYS_CHANNEL5_TCA0_CMP2_LCMP2_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL5_TCB0_CAPT_gc    = (EVSYS_CHANNEL5_TCB0_CAPT_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL5_TCB0_OVF_gc     = (EVSYS_CHANNEL5_TCB0_OVF_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL5_TCB1_CAPT_gc    = (EVSYS_CHANNEL5_TCB1_CAPT_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL5_TCB1_OVF_gc     = (EVSYS_CHANNEL5_TCB1_OVF_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL5_TCB2_CAPT_gc    = (EVSYS_CHANNEL5_TCB2_CAPT_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL5_TCB2_OVF_gc     = (EVSYS_CHANNEL5_TCB2_OVF_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL5_TCD0_CMPBCLR_gc = (EVSYS_CHANNEL5_TCD0_CMPBCLR_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter D0 event 0 */
    EVSYS_CHANNEL5_TCD0_CMPASET_gc = (EVSYS_CHANNEL5_TCD0_CMPASET_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter D0 event 1 */
    EVSYS_CHANNEL5_TCD0_CMPBSET_gc = (EVSYS_CHANNEL5_TCD0_CMPBSET_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter D0 event 2 */
    EVSYS_CHANNEL5_TCD0_PROGEV_gc  = (EVSYS_CHANNEL5_TCD0_PROGEV_gv << EVSYS_CHANNEL5_gp)   /* Timer/Counter D0 event 3 */
} EVSYS_CHANNEL5_t;

/* Software event on channel select bit group values */
typedef enum EVSYS_SWEVENTA_VALUES_enum
{
    EVSYS_SWEVENTA_CH0_gv          = 0x01,  /* Software event on channel 0 */
    EVSYS_SWEVENTA_CH1_gv          = 0x02,  /* Software event on channel 1 */
    EVSYS_SWEVENTA_CH2_gv          = 0x04,  /* Software event on channel 2 */
    EVSYS_SWEVENTA_CH3_gv          = 0x08,  /* Software event on channel 3 */
    EVSYS_SWEVENTA_CH4_gv          = 0x10,  /* Software event on channel 4 */
    EVSYS_SWEVENTA_CH5_gv          = 0x20,  /* Software event on channel 5 */
    EVSYS_SWEVENTA_CH6_gv          = 0x40,  /* Software event on channel 6 */
    EVSYS_SWEVENTA_CH7_gv          = 0x80   /* Software event on channel 7 */
} EVSYS_SWEVENTA_values_t;

/* Software event on channel select bit group configurations*/
typedef enum EVSYS_SWEVENTA_enum
{
    EVSYS_SWEVENTA_CH0_gc          = (EVSYS_SWEVENTA_CH0_gv << EVSYS_SWEVENTA_gp),  /* Software event on channel 0 */
    EVSYS_SWEVENTA_CH1_gc          = (EVSYS_SWEVENTA_CH1_gv << EVSYS_SWEVENTA_gp),  /* Software event on channel 1 */
    EVSYS_SWEVENTA_CH2_gc          = (EVSYS_SWEVENTA_CH2_gv << EVSYS_SWEVENTA_gp),  /* Software event on channel 2 */
    EVSYS_SWEVENTA_CH3_gc          = (EVSYS_SWEVENTA_CH3_gv << EVSYS_SWEVENTA_gp),  /* Software event on channel 3 */
    EVSYS_SWEVENTA_CH4_gc          = (EVSYS_SWEVENTA_CH4_gv << EVSYS_SWEVENTA_gp),  /* Software event on channel 4 */
    EVSYS_SWEVENTA_CH5_gc          = (EVSYS_SWEVENTA_CH5_gv << EVSYS_SWEVENTA_gp),  /* Software event on channel 5 */
    EVSYS_SWEVENTA_CH6_gc          = (EVSYS_SWEVENTA_CH6_gv << EVSYS_SWEVENTA_gp),  /* Software event on channel 6 */
    EVSYS_SWEVENTA_CH7_gc          = (EVSYS_SWEVENTA_CH7_gv << EVSYS_SWEVENTA_gp)   /* Software event on channel 7 */
} EVSYS_SWEVENTA_t;

/* Software event on channel select bit group values */
typedef enum EVSYS_SWEVENTB_VALUES_enum
{
    EVSYS_SWEVENTB_CH8_gv          = 0x00,  /* Software event on channel 8 */
    EVSYS_SWEVENTB_CH9_gv          = 0x01   /* Software event on channel 9 */
} EVSYS_SWEVENTB_values_t;

/* Software event on channel select bit group configurations*/
typedef enum EVSYS_SWEVENTB_enum
{
    EVSYS_SWEVENTB_CH8_gc          = (EVSYS_SWEVENTB_CH8_gv << EVSYS_SWEVENTB_gp),  /* Software event on channel 8 */
    EVSYS_SWEVENTB_CH9_gc          = (EVSYS_SWEVENTB_CH9_gv << EVSYS_SWEVENTB_gp)   /* Software event on channel 9 */
} EVSYS_SWEVENTB_t;

/* User channel select bit group values */
typedef enum EVSYS_USER_VALUES_enum
{
    EVSYS_USER_OFF_gv              = 0x00,  /* Off */
    EVSYS_USER_CHANNEL0_gv         = 0x01,  /* Connect user to event channel 0 */
    EVSYS_USER_CHANNEL1_gv         = 0x02,  /* Connect user to event channel 1 */
    EVSYS_USER_CHANNEL2_gv         = 0x03,  /* Connect user to event channel 2 */
    EVSYS_USER_CHANNEL3_gv         = 0x04,  /* Connect user to event channel 3 */
    EVSYS_USER_CHANNEL4_gv         = 0x05,  /* Connect user to event channel 4 */
    EVSYS_USER_CHANNEL5_gv         = 0x06   /* Connect user to event channel 5 */
} EVSYS_USER_values_t;

